## Отчет по лабораторной работе № 1

#### № группы: `ПМ-2502`

#### Выполнила: `Богоявленская Татьяна Сергеевна`

#### Вариант: `1`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи

>Программа получает на вход параметры $a$ и $b$, которые вводятся с клавиатуры.
>
>Они подставляются в данное выражение:
>
>$$\frac{x-a}{b*x} ≥ 0$$
>
>И в результате программа выдает значения $x$ для которых это выражение верно.

Для решения этой задачи будем подразумевать, что $a$ и $b$ это числа.
Так как параметры вводятся с клавиатуры возможны два варианта:

1. $a$ - любое вещественное число и $b = 0$

   
    Решений для $x$ из вещественных чисел тогда нет, програма должна выдать предупрежение о некоректном вводном параметре
2. $a$ - любое вещественное число и $b ≠ 0$
   
    Тогда решения для $x$ будут зависть от знака параметра $b$ и от значения параметра $a$

   

### 2. Входные и выходные данные

#### Данные на вход

На вход программа должна получать 2 параметра, предположим что это числа, при этом в условии не сказано, к какому множеству принадлежать вводимые числа, поэтому будем считать их вещественными.

|             | Тип                |   min значение   |   max значение    |
|-------------|--------------------|------------------|-------------------|
| a (Число 1) | Вещественное число | -2<sup>1024</sup>| 2<sup>1024</sup>  |
| b (Число 2) | Вещественное число | -2<sup>1024</sup>| 2<sup>1024</sup>  |

#### Данные на выход

Т.к. программа должна вывести значение для $x$, то на выход мы получим тоже вещественное число.

|         | Тип                |   min значение     |    max значение   |
|---------|--------------------|--------------------|-------------------|
| Число 1 | Вещественное число | -2<sup>1024</sup>  | 2<sup>1024</sup>  |

### 3. Выбор структуры данных

Программа получает 2 вещественных числа. Поэтому для их хранения
можно выделить 2 переменных (`a` и `b`) типа `double`.

|             | название переменной | Тип (в Java) | 
|-------------|---------------------|--------------|
| a (Число 1) | `a`                 | `double`     |
| b (Число 2) | `b`                 | `double`     | 

Для вывода результата необязательно его хранить в отдельной переменной.

### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает два вещественных числа, обозначенных как `a` и `b`.

2. **Корректность ввода:**
   
   Программа сравнивает значение `b` c `0` и принимает решение можно ли действовать дальше.

   Если `b≠0`, программа переходит к следующему шагу.
   
3. **Значение параметра $b$**
   
   Если $b≠0$ то значение $x$ зависят от знака параметра $b$ и от значения параметра $a$

   1. Если $b > 0$ и $a$ - любое вещественное число 

      Тогда решения для $x$ будут зависть только от параметра $a$:

      $$\frac{x-a}{x}≥0$$

      Для этого случая надо рассмотреть три варианта:

      1.  $a=0$
         
         Тогда выражение верно для любого $x≠0$

      2.  $a>0$
        
         $x<0$ или $x≥a$
     
      3.  $a<0$
         
         $x≤a$ или $x>0$
         
        
   2. Если $b < 0$ и $a$ - любое вещественное число
   
   Тогда решения для $x$ будут зависть только от параметра $a$:

   $$\frac{x-a}{x}≤0$$
   
   Для этого случая надо рассмотреть три варианта:

      1.  $a=0$
        
      Нет решений среди вещественныхчисел для 'x'

      2.  $a>0$
        
      $0<x≤a$
     
      3.  $a<0$
         
      $a≤x≤0$
         
  

7. **Вычисления значения для $x$**
  
 Програма сравнивает значение $b$ с нулем потом значение  $a$ с нулем и выдает промежутокикотрые являются решением для $x$


10. **Вывод результата:**  
    На экран выводятся решение для $х$

#### Блок-схема

```mermaid


```

### 5. Программа

```java
import java.util.Scanner;
public class Main {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        System.out.print("Введите a: ");
        double a = scanner.nextDouble();

        System.out.print("Введите b: ");
        double b = scanner.nextDouble();

          if (b == 0) {
              System.out.println("b не может быть равно 0");
              return;
          }

          if (b > 0) {
              if (a == 0) {
                  System.out.println("x ≠ 0");
              }

              else if (a > 0) {
                  System.out.println("x < 0 или x ≥ " + a);
              }

              else {
                  System.out.println("x ≤ " + a + " или x > 0");
              }
          }

          else {
              if (a == 0) {
                  System.out.println("Нет решений для x");
              }
              else if (a > 0) {
                  System.out.println("0 < x ≤ " + a);
              }
              else {
                  System.out.println(a + " ≤ x ≤ 0");
              }
          }

                scanner.close();
    }
}

```

### 6. Анализ правильности решения

Программа работает корректно на всем множестве решений с учетом ограничений.

1. Тест на `a=0 b=0`:

    - **Input**:
        ```
        0 0
        ```

    - **Output**:
        ```
        b не может быть равно 0
        ```

2. Тест на `a=0 b≠0`:

    - **Input**:
        ```
        0 2
        ```

    - **Output**:
        ```
        x ≠ 0
        ```

3. Тест на `a≠0 b=0`:

    - **Input**:
        ```
        2 0
        ```

    - **Output**:
        ```
        b не может быть равно 0
        ```

4. Тест на `b>0 a=0`:

    - **Input**:
        ```
       -3 0
        ```

    - **Output**:
        ```
        Нет решений для x
        ```
5. Тест на `b>0 a>0`:

    - **Input**:
        ```
       4 3
        ```

    - **Output**:
        ```
        x < 0 или x ≥ 3.0
        ```
6. Тест на `b>0 a<0`:

    - **Input**:
        ```
       4 -5
        ```

    - **Output**:
        ```
        x ≤ -5.0 или x > 0
        ```
7. Тест на `b<0 a=0`:

    - **Input**:
        ```
       -6 0
        ```

    - **Output**:
        ```
        Нет решений для x
        ```
 6. Тест на `b<0 a>0`:

    - **Input**:
        ```
       -5 4
        ```

    - **Output**:
        ```
        0 < x ≤ 4.0
        
        ```
        
7. Тест на `b<0 a<0`:

    - **Input**:
        ```
       -6 -7
        ```

    - **Output**:
        ```
        -6.0 ≤ x ≤ 0
        ```   
10. Тест на ограничение задачи:

    - **Input**:
        ```
       
        ```

    - **Output**:
        ```
        
        ```
